In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [4]:
labels

['a', 'b', 'c']

In [5]:
my_data

[10, 20, 30]

In [6]:
arr

array([10, 20, 30])

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

In [8]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [12]:
pd.Series(arr,labels
         )

a    10
b    20
c    30
dtype: int32

In [13]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [15]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [16]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [17]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [18]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [28]:
ser2=pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [20]:
ser2

USA        1
Germany    2
Italy      5
Jpana      4
dtype: int64

In [21]:
ser3=pd.Series(data=labels)

In [22]:
ser3

0    a
1    b
2    c
dtype: object

In [23]:
ser3[0
   ]

'a'

In [25]:
ser2['USA']

1

In [29]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [1]:
#DATA FRAMES

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [5]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [10]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [11]:
df

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646 -0.497104
C -0.754070 -0.943406  0.484752 -0.116773
D  1.901755  0.238127  1.996652 -0.993263
E  0.196800 -1.136645  0.000366  1.025984

In [12]:
df=pd.DataFrame(randn(5,4))

In [13]:
df

          0         1         2         3
0 -0.156598 -0.031579  0.649826  2.154846
1 -0.610259 -0.755325 -0.346419  0.147027
2 -0.479448  0.558769  1.024810 -0.925874
3  1.862864 -1.133817  0.610478  0.386030
4  2.084019 -0.376519  0.230336  0.681209

In [14]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [15]:
df

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514
E -0.494095 -0.162535  0.485809  0.392489

In [16]:
df['W']

A    1.035125
B   -0.741790
C    1.482495
D    1.192241
E   -0.494095
Name: W, dtype: float64

In [17]:
type(df['W'])

pandas.core.series.Series

In [18]:
df.W

A    1.035125
B   -0.741790
C    1.482495
D    1.192241
E   -0.494095
Name: W, dtype: float64

In [19]:
df[['W','Z']]

          W         Z
A  1.035125 -1.005187
B -0.741790 -1.382920
C  1.482495  0.992573
D  1.192241 -1.467514
E -0.494095  0.392489

In [21]:
df['new']=df['W']+df['Y']

In [22]:
df

          W         X         Y         Z       new
A  1.035125 -0.031160  1.939932 -1.005187  2.975057
B -0.741790  0.187125 -0.732845 -1.382920 -1.474635
C  1.482495  0.961458 -2.141212  0.992573 -0.658717
D  1.192241 -1.046780  1.292765 -1.467514  2.485005
E -0.494095 -0.162535  0.485809  0.392489 -0.008287

In [24]:
df.drop('new',axis=1)

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514
E -0.494095 -0.162535  0.485809  0.392489

In [25]:
df

          W         X         Y         Z       new
A  1.035125 -0.031160  1.939932 -1.005187  2.975057
B -0.741790  0.187125 -0.732845 -1.382920 -1.474635
C  1.482495  0.961458 -2.141212  0.992573 -0.658717
D  1.192241 -1.046780  1.292765 -1.467514  2.485005
E -0.494095 -0.162535  0.485809  0.392489 -0.008287

In [26]:
df.drop('new',axis=1,inplace=True)

In [27]:
df

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514
E -0.494095 -0.162535  0.485809  0.392489

In [29]:
df.drop('E',axis=0)

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514

In [30]:
df

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514
E -0.494095 -0.162535  0.485809  0.392489

In [31]:
df.shape

(5, 4)

In [32]:
df[['Z','X']]

          Z         X
A -1.005187 -0.031160
B -1.382920  0.187125
C  0.992573  0.961458
D -1.467514 -1.046780
E  0.392489 -0.162535

In [33]:
#ROWS

In [34]:
df

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514
E -0.494095 -0.162535  0.485809  0.392489

In [35]:
df.loc['A']

W    1.035125
X   -0.031160
Y    1.939932
Z   -1.005187
Name: A, dtype: float64

In [36]:
df.iloc[0]

W    1.035125
X   -0.031160
Y    1.939932
Z   -1.005187
Name: A, dtype: float64

In [37]:
df.loc['B','Y'] #row and colun

-0.7328451475428807

In [40]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.035125  1.939932
B -0.741790 -0.732845

In [41]:
#DATA FRAME Part2

In [44]:
booldf=df>0

In [45]:
booldf

       W      X      Y      Z
A   True  False   True  False
B  False   True  False  False
C   True   True  False   True
D   True  False   True  False
E  False  False   True   True

In [46]:
df[booldf]

          W         X         Y         Z
A  1.035125       NaN  1.939932       NaN
B       NaN  0.187125       NaN       NaN
C  1.482495  0.961458       NaN  0.992573
D  1.192241       NaN  1.292765       NaN
E       NaN       NaN  0.485809  0.392489

In [47]:
df[df>0]

          W         X         Y         Z
A  1.035125       NaN  1.939932       NaN
B       NaN  0.187125       NaN       NaN
C  1.482495  0.961458       NaN  0.992573
D  1.192241       NaN  1.292765       NaN
E       NaN       NaN  0.485809  0.392489

In [48]:
df

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514
E -0.494095 -0.162535  0.485809  0.392489

In [49]:
df['W']>0

A     True
B    False
C     True
D     True
E    False
Name: W, dtype: bool

In [50]:
df['W']

A    1.035125
B   -0.741790
C    1.482495
D    1.192241
E   -0.494095
Name: W, dtype: float64

In [51]:
df[df['W']>0]

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514

In [53]:
df[df['Z']<0]

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
D  1.192241 -1.046780  1.292765 -1.467514

In [55]:
resultdf=df[df['Z']>0]

In [56]:
resultdf['X']

C    0.961458
E   -0.162535
Name: X, dtype: float64

In [60]:
df[df['W']>0][['X','Y']]

          X         Y
A -0.031160  1.939932
C  0.961458 -2.141212
D -1.046780  1.292765

In [62]:
df[(df['W']>0) & (df['Y']>1)]

          W        X         Y         Z
A  1.035125 -0.03116  1.939932 -1.005187
D  1.192241 -1.04678  1.292765 -1.467514

In [64]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514

In [65]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.035125 -0.031160  1.939932 -1.005187
1     B -0.741790  0.187125 -0.732845 -1.382920
2     C  1.482495  0.961458 -2.141212  0.992573
3     D  1.192241 -1.046780  1.292765 -1.467514
4     E -0.494095 -0.162535  0.485809  0.392489

In [66]:
newind='CA NY WY OR CO'.split()

In [67]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [68]:
df['States']=newind

In [69]:
df

          W         X         Y         Z States
A  1.035125 -0.031160  1.939932 -1.005187     CA
B -0.741790  0.187125 -0.732845 -1.382920     NY
C  1.482495  0.961458 -2.141212  0.992573     WY
D  1.192241 -1.046780  1.292765 -1.467514     OR
E -0.494095 -0.162535  0.485809  0.392489     CO

In [70]:
df.set_index('States')

               W         X         Y         Z
States
CA      1.035125 -0.031160  1.939932 -1.005187
NY     -0.741790  0.187125 -0.732845 -1.382920
WY      1.482495  0.961458 -2.141212  0.992573
OR      1.192241 -1.046780  1.292765 -1.467514
CO     -0.494095 -0.162535  0.485809  0.392489

In [71]:
#DATAFRAMES 3

In [72]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [73]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [74]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [75]:
df

             A         B
G1 1  0.221491 -0.855196
   2  1.541990  0.666319
   3 -0.538235 -0.568581
G2 1  1.407338  0.641806
   2 -0.905100 -0.391157
   3  1.028293 -1.972605

In [76]:
df.loc['G1'].loc[1]

A    0.221491
B   -0.855196
Name: 1, dtype: float64

In [77]:
df.loc['G1']

          A         B
1  0.221491 -0.855196
2  1.541990  0.666319
3 -0.538235 -0.568581

In [78]:
df.index.names=['Groups','Num']

In [79]:
df

                   A         B
Groups Num
G1     1    0.221491 -0.855196
       2    1.541990  0.666319
       3   -0.538235 -0.568581
G2     1    1.407338  0.641806
       2   -0.905100 -0.391157
       3    1.028293 -1.972605

In [81]:
df.loc['G2'].loc[2].loc['B']

-0.3911566271858832

In [82]:
df.loc['G1'].loc[3].loc['A']

-0.5382346255173922

In [83]:
df.xs('G1')

            A         B
Num
1    0.221491 -0.855196
2    1.541990  0.666319
3   -0.538235 -0.568581

In [84]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.221491 -0.855196
G2      1.407338  0.641806

In [85]:
#MISSING DATA

In [86]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [88]:
df=pd.DataFrame(d)

In [89]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [90]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [91]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [92]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [93]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [94]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [95]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [98]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [99]:
#GROUPBY

In [4]:
import numpy as np
import pandas as pd
from numpy.random import randn
df1=pd.DataFrame(randn(5,4))

#

In [5]:
df1

          0         1         2         3
0  1.363236  0.006025 -0.768045 -1.717165
1  0.659920 -0.277712 -1.167130  0.364046
2  1.696490  0.414343  0.914874 -0.907107
3 -0.660063  0.681441 -0.124500  1.001106
4  0.736984  0.537597  0.868929  0.756690

In [6]:
a=list(df1[0])

In [7]:
a

[1.3632355687935767,
 0.6599199875647972,
 1.6964903765916701,
 -0.6600633422378434,
 0.7369839832223679]

In [9]:
df1['test']=a

In [10]:
df1

          0         1         2         3      test
0  1.363236  0.006025 -0.768045 -1.717165  1.363236
1  0.659920 -0.277712 -1.167130  0.364046  0.659920
2  1.696490  0.414343  0.914874 -0.907107  1.696490
3 -0.660063  0.681441 -0.124500  1.001106 -0.660063
4  0.736984  0.537597  0.868929  0.756690  0.736984

In [15]:
data={'Company':['GOOG','GOOG','MSFT', 'MSFT','FB','FB'], 'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}

In [16]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [17]:
df=pd.DataFrame(data)

In [18]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [20]:
byComp=df.groupby('Company')

In [22]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [23]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [24]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [25]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [27]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [28]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [29]:
df.groupby("Company").max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [30]:
df.groupby("Company").min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [31]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [32]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64